10/data/attachments/a313ce664b030f82.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_3366b451-5789-4053-9ce3-aaa5786d2676</nif:username>
            <nif:friendToBeAdded>Katie_movement_Friend_66964_9</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>